                                        24 Feb - Pandas

Q1. List any five functions of the pandas library with execution.

In [74]:
data = ({ 'Name' : ['Ronaldo', 'Messi', 'Rashford', 'Zlatan'],
          'Goal' : [15, 10, 12, 8],
          'Assist' : [5,10,8, 3],
          'Position' : [ 'ST', 'RW', 'LM', 'ST']})

In [75]:
import pandas as pd

In [76]:
df = pd.DataFrame(data)

In [77]:
df

       Name  Goal  Assist Position
0   Ronaldo    15       5       ST
1     Messi    10      10       RW
2  Rashford    12       8       LM
3    Zlatan     8       3       ST

In [78]:
#1. head : gives line items from first row

df.head(2)

      Name  Goal  Assist Position
0  Ronaldo    15       5       ST
1    Messi    10      10       RW

In [79]:
#2. tail() : gives line items from end row

df.tail(2)

       Name  Goal  Assist Position
2  Rashford    12       8       LM
3    Zlatan     8       3       ST

In [80]:
#5. max() : get the maximum value from the specific column

df['Goal'].max()

15

In [81]:
#4. describe() : summarization on stats

df.describe()

            Goal     Assist
count   4.000000   4.000000
mean   11.250000   6.500000
std     2.986079   3.109126
min     8.000000   3.000000
25%     9.500000   4.500000
50%    11.000000   6.500000
75%    12.750000   8.500000
max    15.000000  10.000000

In [82]:
#5 set_index = Set the index

df.set_index('Name')

          Goal  Assist Position
Name
Ronaldo     15       5       ST
Messi       10      10       RW
Rashford    12       8       LM
Zlatan       8       3       ST

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [83]:
data = { 'A' : [1,2,3,4],
         'B' : [10, 20, 30, 40],
         'C' : [100, 200, 300, 400]
       }

df1 = pd.DataFrame(data)

In [ ]:
df1

In [84]:

list = []
def index_test(length):
    s = 0 
    i = 1
    while s < length: 
        list.append(i)
        i += 2
        s += 1

In [85]:
index_test(len(df1['A']))
list

[1, 3, 5, 7]

In [86]:
df['New Index'] = list

In [87]:
df

       Name  Goal  Assist Position  New Index
0   Ronaldo    15       5       ST          1
1     Messi    10      10       RW          3
2  Rashford    12       8       LM          5
3    Zlatan     8       3       ST          7

In [88]:
df.set_index('New Index')

               Name  Goal  Assist Position
New Index
1           Ronaldo    15       5       ST
3             Messi    10      10       RW
5          Rashford    12       8       LM
7            Zlatan     8       3       ST

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [89]:
data3 = {'Values' : [10, 20, 30, 40, 50]}

In [90]:
df3 = pd.DataFrame(data3)

In [91]:
df3

   Values
0      10
1      20
2      30
3      40
4      50

In [92]:
#function sum of the first three values in the 'Values' column

def test_sum(n):
    i = 0
    s = 0
    for i,r in df3.iterrows():
        if i<n:
            s += r['Values']
        i +=1
    print(s)

In [93]:
test_sum(3)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [94]:
data4 = {"Text" : [ 'Hello World', 'I am from', 'Kolkata', 'my name is Sovan']}

In [95]:
df4 = pd.DataFrame(data4)

In [96]:
df4

               Text
0       Hello World
1         I am from
2           Kolkata
3  my name is Sovan

In [97]:
#counting the words 

l = []
for i,r in df4.iterrows():
    l.append(len(r['Text'].split()))

In [98]:
df4['Word_Count'] = l

In [99]:
df4

               Text  Word_Count
0       Hello World           2
1         I am from           3
2           Kolkata           1
3  my name is Sovan           4

Q5. How are DataFrame.size() and DataFrame.shape() different?

Ans: 

DataFrame.size() :  return total number of elements present in your DataFrame
    
DataFrame.shape() : return the no of rows, columns of your DataFrame

In [100]:
df4

               Text  Word_Count
0       Hello World           2
1         I am from           3
2           Kolkata           1
3  my name is Sovan           4

In [101]:
df4.size

8

In [102]:
df4.shape

(4, 2)

Q6. Which function of pandas do we use to read an excel file?

ans : read_excel()

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [103]:
data7 = {'Email' : ['username10@domain.com', 'username20@domain.com', 'username30@domain.com', 'username40@domain.com']}
df7 = pd.DataFrame(data7)
df7

                   Email
0  username10@domain.com
1  username20@domain.com
2  username30@domain.com
3  username40@domain.com

In [104]:
l = []
for i, r in df7.iterrows():
    l.append(r['Email'].split('@'))

In [105]:
l

[['username10', 'domain.com'],
 ['username20', 'domain.com'],
 ['username30', 'domain.com'],
 ['username40', 'domain.com']]

In [106]:
l1 = []
for i in l:
    l1.append(i[0])

In [107]:
l1

['username10', 'username20', 'username30', 'username40']

In [108]:
df7['Username'] = l1

In [109]:
df7

                   Email    Username
0  username10@domain.com  username10
1  username20@domain.com  username20
2  username30@domain.com  username30
3  username40@domain.com  username40

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:

A B C

0 3 5 1

1 8 2 7

2 6 9 4

3 2 3 5

4 9 1 2

Your function should select the following rows: A B C

1 8 2 7

4 9 1 2

The function should return a new DataFrame that contains only the selected rows.

In [110]:
data8 = { 'A' : [3,8,6,2,9],
          'B' : [5,2,9,3,1],
          'C' : [1,7,4,5,2]}

In [111]:
df8 = pd.DataFrame(data8)
df8

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [112]:
#value in column 'A' is greater than 5 and the value in column 'B' is less than 10.

df81 = df8[(df8['A']>5)]

In [113]:
df81[(df81['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [114]:
df3

   Values
0      10
1      20
2      30
3      40
4      50

In [115]:
df3['Values'].mean()

30.0

In [116]:
df3['Values'].median()

30.0

In [117]:
df3['Values'].std()

15.811388300841896

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [118]:
Data10 = {'Sales' : [10,20,9,14,2,5,5,3,4], 'Date' : ['01-10-2023', '02-10-2023','03-10-2023','04-10-2023','05-10-2023','06-10-2023','07-10-2023','08-10-2023','09-10-2023'
]}
df10 = pd.DataFrame(Data10)
df10

   Sales        Date
0     10  01-10-2023
1     20  02-10-2023
2      9  03-10-2023
3     14  04-10-2023
4      2  05-10-2023
5      5  06-10-2023
6      5  07-10-2023
7      3  08-10-2023
8      4  09-10-2023

In [119]:
df10['MovingAverage'] = df10['Sales'].rolling(7).mean()

In [120]:
df10

   Sales        Date  MovingAverage
0     10  01-10-2023            NaN
1     20  02-10-2023            NaN
2      9  03-10-2023            NaN
3     14  04-10-2023            NaN
4      2  05-10-2023            NaN
5      5  06-10-2023            NaN
6      5  07-10-2023       9.285714
7      3  08-10-2023       8.285714
8      4  09-10-2023       6.000000

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:

Date

0 2023-01-01

1 2023-01-02

2 2023-01-03

3 2023-01-04

4 2023-01-05

Your function should create the following DataFrame:


Date Weekday

0 2023-01-01 Sunday

1 2023-01-02 Monday

2 2023-01-03 Tuesday

3 2023-01-04 Wednesday

4 2023-01-05 Thursday

The function should return the modified DataFrame.

In [121]:
Data11 = { 'Date' : ['01-01-2023', '01-02-2023','01-03-2023','01-04-2023','01-05-2023']}
df11 = pd.DataFrame(Data11)
df11

         Date
0  01-01-2023
1  01-02-2023
2  01-03-2023
3  01-04-2023
4  01-05-2023

In [122]:
df11['Date'] = pd.to_datetime(df11['Date'])

In [123]:
df11

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [124]:
df11['Updated Date'] = df11['Date'].dt.weekday
df11

        Date  Updated Date
0 2023-01-01             6
1 2023-01-02             0
2 2023-01-03             1
3 2023-01-04             2
4 2023-01-05             3

In [125]:
l11 = []
for i, r in df11.iterrows():
    if r['Updated Date'] == 0 :
        l11.append('Monday')
    if r['Updated Date'] == 1:
        l11.append('Tuesday')
                 
    if r['Updated Date']== 2:
        l11.append('Wednesday')
    if r['Updated Date']==3:
        l11.append('Thursday')
    if r['Updated Date'] == 4:
        l11.append('Friday')
    if r['Updated Date'] == 5:
        l11.append('Saturday')
    if r['Updated Date'] == 6:
        l11.append('Sunday')        
l11

['Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday']

In [126]:
df11['Weekday'] = l11

In [127]:
df11

        Date  Updated Date    Weekday
0 2023-01-01             6     Sunday
1 2023-01-02             0     Monday
2 2023-01-03             1    Tuesday
3 2023-01-04             2  Wednesday
4 2023-01-05             3   Thursday

In [128]:
df11n = df11[['Date','Weekday']]

In [129]:
df11n

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [156]:

import pandas as pd


df12 = pd.DataFrame(np.random.random((200)))

df12['date'] = pd.date_range('2023-1-1', periods=200) 

data12 =  (df12['date'] >= '2023-1-1') & (df12['date'] <= '2023-1-31')

df12n = df12[data12]

df12n[['date']]

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31